tap "oven-sh/bun"
tap "supabase/tap"

brew "aws-sam-cli"
brew "awscli"
brew "cmake"
brew "composer"
brew "fdupes"
brew "fzf"
brew "gh"
brew "git-delta"
brew "git-lfs"
brew "lazygit"
brew "mint"
brew "neovim"
brew "oven-sh/bun/bun"
brew "poppler"
brew "starship"
brew "supabase/tap/supabase"
brew "swiftformat"
brew "swiftlint"
brew "tfenv"
brew "tree"
brew "uv"
brew "xcodegen"
brew "zoxide"

cask "codex"
cask "codexbar"
cask "font-jetbrains-mono-nerd-font"
cask "karabiner-elements"
cask "raycast"
cask "visual-studio-code"
cask "wezterm@nightly"
