anthropic.claude-code
bmewburn.vscode-intelephense-client
bradlc.vscode-tailwindcss
cloudlatex.cloudlatex
cweijan.dbclient-jdbc
cweijan.vscode-mysql-client2
dbaeumer.vscode-eslint
eamodio.gitlens
ecmel.vscode-html-css
esbenp.prettier-vscode
github.vscode-github-actions
google.colab
google.gemini-cli-vscode-ide-companion
google.geminicodeassist
googlecloudtools.cloudcode
googlecloudtools.datacloud
hashicorp.terraform
james-yu.latex-workshop
justusadam.language-haskell
llvm-vs-code-extensions.lldb-dap
mechatroner.rainbow-csv
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-ceintl.vscode-language-pack-ja
ms-dotnettools.vscode-dotnet-runtime
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
oderwat.indent-rainbow
openai.chatgpt
postman.postman-for-vscode
svelte.svelte-vscode
swiftlang.swift-vscode
tamasfe.even-better-toml
tomoki1207.pdf
tonybaloney.vscode-pets
vscjava.vscode-gradle
vue.volar
yzhang.markdown-all-in-one
